{
    "title": "IBM Cloud VPC docs",
    "lastupdated": "2023-01-06",
    "introduction": "With IBM Cloud Virtual Private Cloud (VPC), you can quickly provision virtual server instances and other Infrastructure-as-a-Service (IaaS) offerings. Leverage the docs, API & SDK reference, architecture references, and more to support your infrastructure needs.",
    "section_devtools": {
      "api": "/apidocs/vpc",
      "cli": "/docs/vpc?topic=vpc-infrastructure-cli-plugin-vpc-reference",
      "terraform": "https://registry.terraform.io/providers/IBM-Cloud/ibm/latest/docs/resources/is_instance"
    },
    "section_recommended": [
      {
        "title": "Using the IBM Cloud console to create VPC resources",
        "description": "Get up and running quickly by completing this short tutorial to set up a VPC and subnet, configure an ACL, and create a virtual server instance with block storage and networking options.",
        "href": "/docs/vpc?topic=vpc-creating-a-vpc-using-the-ibm-cloud-console"
      },
      {
        "title": "Creating an instance group for auto scaling",
        "description": "Set up an instance group to dynamically add or remove instances according to your requirements.",
        "href": "/docs/vpc?topic=vpc-creating-auto-scale-instance-group"
      },
      {
        "title": "About creating an image from a volume",
        "description": "Learn about creating a custom image from a boot volume on a virtual server instance.",
        "href": "/docs/vpc?topic=vpc-image-from-volume-vpc"
      }
    ],
    "section_learn": {
      "architecture": "https://www.ibm.com/cloud/architecture/architectures/virtual-private-cloud"
    },
    "section_updates": {
      "view_more": "/docs/vpc?topic=vpc-release-notes",
      "tiles": [
        {
          "date": "05 January 2023",
          "title": "New region (London) for LinuxONE Bare Metal Servers (s390x processor architecture) (LA)",
          "description": "LinuxONE Bare Metal Servers are now available in the London (eu-gb) region. "
        },
        {
          "date": "20 December 2022",
          "title": "Instance provision by volume (Beta)",
          "description": "By default, when a virtual server instance is deleted attached boot volumes are deleted. You can disable this behavior, causing the boot volume to instead be detached when the virtual server instance is deleted. You can then attach the boot volume to a new virtual server instance"
        },
        {
          "date": "20 December 2022",
          "title": "Backup for VPC",
          "description": "The backup policy jobs feature, previously released as a Beta, is now generally available. You can now view all backup policy jobs or details of a single job from the UI, CLI, or API. A backup policy job is triggered when a scheduled backup snapshot is being created or deleted. If the create or delete action is successful, the job contains information about the backup snapshot that was created or deleted. If the job ran unsuccessfully, the job contains the reason for the failure."
        }
      ]
    }
  }
