
{
    "title": "IBM Cloud VPC docs",
    "lastupdated": "2024-10-02",
    "introduction": "With IBM Cloud Virtual Private Cloud (VPC), you can quickly provision virtual server instances and other Infrastructure-as-a-Service (IaaS) offerings. Leverage the docs, API & SDK reference, architecture references, and more to support your infrastructure needs.",
    "section_devtools": {
      "api": "/apidocs/vpc",
      "cli": "/docs/vpc?topic=vpc-set-up-environment&interface=cli",
      "terraform": "https://registry.terraform.io/providers/IBM-Cloud/ibm/latest/docs/resources/is_instance"
    },
    "section_recommended": [
      {
        "title": "Using the IBM Cloud console to create VPC resources",
        "description": "Get up and running quickly by completing this short tutorial to set up a VPC and subnet, configure an ACL, and create a virtual server instance with block storage and networking options.",
        "href": "/docs/vpc?topic=vpc-creating-a-vpc-using-the-ibm-cloud-console"
      },
      {
        "title": "Creating an instance group for auto scaling",
        "description": "Set up an instance group to dynamically add or remove instances according to your requirements.",
        "href": "/docs/vpc?topic=vpc-creating-auto-scale-instance-group"
      },
      {
        "title": "About creating an image from a volume",
        "description": "Learn about creating a custom image from a boot volume on a virtual server instance.",
        "href": "/docs/vpc?topic=vpc-image-from-volume-vpc"
      }
    ],
    "section_learn": {
      "architecture": "https://www.ibm.com/topics/vpc"
    },
    "section_updates": {
      "view_more": "/docs/vpc?topic=vpc-release-notes",
      "tiles": [
        {
          "date": "25 September 2024",
          "title": "IBM Hyper Protect Container Runtime image ibm-hyper-protect-container-runtime-1-0-s390x-19 updates",
          "description": "For the IBM Hyper Protect Container Runtime image version ibm-hyper-protect-container-runtime-1-0-s390x-19, new certificates are available."
        },
        {
          "date": "24 September 2024",
          "title": "Block Storage for VPC snapshots for cross-account restore",
          "description": "You can now share a snapshot with another account and allow the other account to create volumes with the snapshot. To do so, you must set up cross-account authorization in Cloud Identity and Access Management, and share the CRN of the snapshot with the other account. The other account's authorized storage administrator can use the CRN to create a volume in the console, from the CLI, with the API, or Terraform."
        },
        {
          "date": "23 September 2024",
          "title": "Backup service integration with Event Notifications",
          "description": "Backup jobs that create or delete backup snapshots run according to the backup plan and the retention policy. You can now set up a connection between the Backup service and Event Notifications and receive notifications to your preferred destinations if a backup job fails."
        }
      ]
    }
  }