{
    "title": "IBM Cloud VPC docs",
    "lastupdated": "2023-03-16",
    "introduction": "With IBM Cloud Virtual Private Cloud (VPC), you can quickly provision virtual server instances and other Infrastructure-as-a-Service (IaaS) offerings. Leverage the docs, API & SDK reference, architecture references, and more to support your infrastructure needs.",
    "section_devtools": {
      "api": "/apidocs/vpc",
      "cli": "/docs/vpc?topic=vpc-infrastructure-cli-plugin-vpc-reference",
      "terraform": "https://registry.terraform.io/providers/IBM-Cloud/ibm/latest/docs/resources/is_instance"
    },
    "section_recommended": [
      {
        "title": "Using the IBM Cloud console to create VPC resources",
        "description": "Get up and running quickly by completing this short tutorial to set up a VPC and subnet, configure an ACL, and create a virtual server instance with block storage and networking options.",
        "href": "/docs/vpc?topic=vpc-creating-a-vpc-using-the-ibm-cloud-console"
      },
      {
        "title": "Creating an instance group for auto scaling",
        "description": "Set up an instance group to dynamically add or remove instances according to your requirements.",
        "href": "/docs/vpc?topic=vpc-creating-auto-scale-instance-group"
      },
      {
        "title": "About creating an image from a volume",
        "description": "Learn about creating a custom image from a boot volume on a virtual server instance.",
        "href": "/docs/vpc?topic=vpc-image-from-volume-vpc"
      }
    ],
    "section_learn": {
      "architecture": "https://www.ibm.com/cloud/architecture/architectures/virtual-private-cloud"
    },
    "section_updates": {
      "view_more": "/docs/vpc?topic=vpc-release-notes",
      "tiles": [
        {
          "date": "16 March 2023",
          "title": "Client-to-site VPN server private certificate support",
          "description": "VPN servers now support the use of Secrets Manager private certificates. Private certificates are SSL/TLS certificates that you can sign, issue, and manage in the Secrets Manager service."
        },
        {
          "date": "10 March 2023",
          "title": "Client server timeout for application load balancers",
          "description": "You can now configure the client and server timeout parameters for IBM Cloud Application Load Balancer for VPC using the UI, CLI, and API. The maximum timeout period for each listener is 2 hours, and the minimum is 50 seconds. If you need a timeout amount greater than 2 hours, open a support case with IBM Support. This functionality is only available for application load balancers."
        },
        {
          "date": "14 February 2023", 
          "title": "VPC instance metadata communication protocol and hop limit",
          "description": "You can now control the communication protocol and hop limit for IP response packets that are used by the VPC Instance Metadata service. When you provision or update an instance, use the new **Secure access** setting to specify either http (default) or https (secure access) communication. You can also use the new Hop limit setting to specify a value between `1` (default) and `64`. Both of these settings apply only when the metadata service is enabled."
        }
      ]
    }
  }
