{
    "title": "IBM Cloud VPC docs",
    "lastupdated": "2022-04-01",
    "introduction": "With IBM Cloud Virtual Private Cloud (VPC), you can quickly provision virtual server instances and other Infrastructure-as-a-Service (IaaS) offerings. Leverage the docs, API & SDK reference, architecture references, and more to support your infrastructure needs.",
    "section_devtools": {
      "api": "/apidocs/vpc", 
      "cli": "/docs/vpc?topic=vpc-infrastructure-cli-plugin-vpc-reference", 
      "terraform": "https://registry.terraform.io/providers/IBM-Cloud/ibm/latest/docs/resources/is_instance"
    },
    "section_recommended": [
      {
        "title": "Using the IBM Cloud console to create VPC resources",
        "description": "Get up and running quickly by completing this short tutorial to set up a VPC and subnet, configure an ACL, and create a virtual server instance with block storage and networking options.",
        "href": "/docs/vpc?topic=vpc-creating-a-vpc-using-the-ibm-cloud-console"
      },
      {
        "title": "Creating an instance group for auto scaling",
        "description": "Set up an instance group to dynamically add or remove instances according to your requirements.",
        "href": "/docs/vpc?topic=vpc-creating-auto-scale-instance-group"
      },
      {
        "title": "About creating an image from a volume",
        "description": "Learn about creating a custom image from a boot volume on a virtual server instance.",
        "href": "/docs/vpc?topic=vpc-image-from-volume-vpc"
      }
    ],
    "section_learn": {
      "architecture": "https://www.ibm.com/cloud/architecture/architectures/virtual-private-cloud"
    },
    "section_updates": {
      "view_more": "/docs/vpc?topic=vpc-release-notes",
      "tiles": [
        {
          "date": "29 March 2022",
          "title": "UDP support for Network Load Balancers (NLB)",
          "description": "You can now set User Datagram Protocol (UDP) as the communication protocol for the Network Load Balancer for VPC (NLB) listener and pool. UDP is a communications protocol for establishing low-latency and loss-tolerating connections between applications on the internet. It speeds up transmissions by enabling the transfer of data before an agreement is provided by the receiving party. When configuring UDP and attaching a pool to your listener, you must configure the pool with the same protocol as the listener."
        },
        {
          "date": "29 March 2022",
          "title": "Reserved IPs",
          "description": "You can now assign an IP address to your virtual server instance by specifying an already reserved IP for private IPs and bind them to network interfaces."
        },
        {
          "date": "24 March 2022",
          "title": "New stock image for virtual servers",
          "description": "Windows 2022 is now supported as a stock image when you provision IBM Cloud VPC virtual servers. "
        }
      ]
    }
  }
