{
    "title": "IBM Cloud VPC docs",
    "lastupdated": "2022-04-21",
    "introduction": "With IBM Cloud Virtual Private Cloud (VPC), you can quickly provision virtual server instances and other Infrastructure-as-a-Service (IaaS) offerings. Leverage the docs, API & SDK reference, architecture references, and more to support your infrastructure needs.",
    "section_devtools": {
      "api": "/apidocs/vpc", 
      "cli": "/docs/vpc?topic=vpc-infrastructure-cli-plugin-vpc-reference", 
      "terraform": "https://registry.terraform.io/providers/IBM-Cloud/ibm/latest/docs/resources/is_instance"
    },
    "section_recommended": [
      {
        "title": "Using the IBM Cloud console to create VPC resources",
        "description": "Get up and running quickly by completing this short tutorial to set up a VPC and subnet, configure an ACL, and create a virtual server instance with block storage and networking options.",
        "href": "/docs/vpc?topic=vpc-creating-a-vpc-using-the-ibm-cloud-console"
      },
      {
        "title": "Creating an instance group for auto scaling",
        "description": "Set up an instance group to dynamically add or remove instances according to your requirements.",
        "href": "/docs/vpc?topic=vpc-creating-auto-scale-instance-group"
      },
      {
        "title": "About creating an image from a volume",
        "description": "Learn about creating a custom image from a boot volume on a virtual server instance.",
        "href": "/docs/vpc?topic=vpc-image-from-volume-vpc"
      }
    ],
    "section_learn": {
      "architecture": "https://www.ibm.com/cloud/architecture/architectures/virtual-private-cloud"
    },
    "section_updates": {
      "view_more": "/docs/vpc?topic=vpc-release-notes",
      "tiles": [
        {
          "date": "11 April 2022",
          "title": "2022-03-29 release of the VPC API introduced incompatible changes",
          "description": "The 2022-03-29 release of the VPC API necessitated incompatible changes in support of the reserved IPs feature. IP addresses are now modeled as objects (resources), rather than strings. Security groups must now be associated with targets rather than network interfaces. Even if you are not planning to make use of reserved IPs, to avoid regressions in client functionality, be sure to reference 2022-03-29 API migration and follow the Action needed recommendations before specifying version 2022-03-29 or later."
        },
        {
          "date": "31 March 2022",
          "title": "Add Other device types as Application Load Balancer (ALB) pool members",
          "description": "You can now add Other device types as ALB back-end pool members, such as servers contained within a Power Systems Virtual Server instance connected over IBM Cloud Direct Link (2.0). In the past, you were only able to select virtual server instances or Bare Metal servers within a VPC. When creating a new member, select the Other tab from the Attach server screen and enter the device IP address."
        },
        {
          "date": "30 March 2022",
          "title": "New stock image for bare metal servers",
          "description": "RHEL 8.4 is now supported as an image when you provision a bare metal server."
        }
      ]
    }
  }
