{
    "title": "IBM Cloud VPC docs",
    "lastupdated": "2024-09-10",
    "introduction": "With IBM Cloud Virtual Private Cloud (VPC), you can quickly provision virtual server instances and other Infrastructure-as-a-Service (IaaS) offerings. Leverage the docs, API & SDK reference, architecture references, and more to support your infrastructure needs.",
    "section_devtools": {
      "api": "/apidocs/vpc",
      "cli": "/docs/vpc?topic=vpc-set-up-environment&interface=cli",
      "terraform": "https://registry.terraform.io/providers/IBM-Cloud/ibm/latest/docs/resources/is_instance"
    },
    "section_recommended": [
      {
        "title": "Using the IBM Cloud console to create VPC resources",
        "description": "Get up and running quickly by completing this short tutorial to set up a VPC and subnet, configure an ACL, and create a virtual server instance with block storage and networking options.",
        "href": "/docs/vpc?topic=vpc-creating-a-vpc-using-the-ibm-cloud-console"
      },
      {
        "title": "Creating an instance group for auto scaling",
        "description": "Set up an instance group to dynamically add or remove instances according to your requirements.",
        "href": "/docs/vpc?topic=vpc-creating-auto-scale-instance-group"
      },
      {
        "title": "About creating an image from a volume",
        "description": "Learn about creating a custom image from a boot volume on a virtual server instance.",
        "href": "/docs/vpc?topic=vpc-image-from-volume-vpc"
      }
    ],
    "section_learn": {
      "architecture": "https://www.ibm.com/topics/vpc"
    },
    "section_updates": {
      "view_more": "/docs/vpc?topic=vpc-release-notes",
      "tiles": [
        {
          "date": "05 September 2024",
          "title": "Red Hat Enteprise Linux AI BYOL custom images (GA)",
          "description": "The Red Hat Enterprise AI (RHEL AI) operating system can be imported as a bring your own license (BYOL). A RHEL AI qcow2 file is available directly from Red Hat."
        },
        {
          "date": "03 September 2024",
          "title": "GPU H100 profile available in select regions (select availability)",
          "description": "The GPU H100 profile is now available on the latest generation GPU-enabled infrastructure for running machine learning (ML) and deep learning (DL) frameworks in support of AI initiatives. The GPU H100 profile is available in the following regions: London (eu-gb), Sydney (au-syd), Toronto (ca-tor), Madrid (eu-es), and Washington DC (us-east). When you use the H100 virtual server profile, it runs on an NVIDIA Hopper-based HGX server and is the sole tenant running on the host."
        },
        {
          "date": "28 August 2024",
          "title": "Reservations for Bare Metal Servers for VPC (beta)",
          "description": "Reservations for Bare Metal Servers for VPC is now available as a beta feature. A reservation is a great option if you want guaranteed resources for future deployments and cost savings. You can choose between either a 1 or 3-year contract term for your reservation."
        }
      ]
    }
  }