{
    "title": "IBM Cloud VPC docs",
    "lastupdated": "2022-10-14S",
    "introduction": "With IBM Cloud Virtual Private Cloud (VPC), you can quickly provision virtual server instances and other Infrastructure-as-a-Service (IaaS) offerings. Leverage the docs, API & SDK reference, architecture references, and more to support your infrastructure needs.",
    "section_devtools": {
      "api": "/apidocs/vpc",
      "cli": "/docs/vpc?topic=vpc-infrastructure-cli-plugin-vpc-reference",
      "terraform": "https://registry.terraform.io/providers/IBM-Cloud/ibm/latest/docs/resources/is_instance"
    },
    "section_recommended": [
      {
        "title": "Using the IBM Cloud console to create VPC resources",
        "description": "Get up and running quickly by completing this short tutorial to set up a VPC and subnet, configure an ACL, and create a virtual server instance with block storage and networking options.",
        "href": "/docs/vpc?topic=vpc-creating-a-vpc-using-the-ibm-cloud-console"
      },
      {
        "title": "Creating an instance group for auto scaling",
        "description": "Set up an instance group to dynamically add or remove instances according to your requirements.",
        "href": "/docs/vpc?topic=vpc-creating-auto-scale-instance-group"
      },
      {
        "title": "About creating an image from a volume",
        "description": "Learn about creating a custom image from a boot volume on a virtual server instance.",
        "href": "/docs/vpc?topic=vpc-image-from-volume-vpc"
      }
    ],
    "section_learn": {
      "architecture": "https://www.ibm.com/cloud/architecture/architectures/virtual-private-cloud"
    },
    "section_updates": {
      "view_more": "/docs/vpc?topic=vpc-release-notes",
      "tiles": [
        {
          "date": "12 October 2022",
          "title": "New region (Washington DC) for LinuxONE Bare Metal Servers (s390x processor architecture) (LA)",
          "description": "LinuxONE Bare Metal Servers are now available in the Washington DC (us-east) region."
        },
        {
          "date": "03 October 2022",
          "title": "VPC Public Ingress Routing",
          "description": "You can now route public internet ingress traffic (destined to a floating IP) to a VPN next-hop IP, such as a managed firewall. Currently, public ingress routing (public internet traffic choice) is available in the UI only. CLI and API are forthcoming."
        },
        {
          "date": "27 September 2022",
          "title": "IBM LinuxONE Bare Metal Servers (s390x processor architecture) (LA)",
          "description": "Accounts with access to the profiles for s390x bare metal servers can now create LinuxONE Bare Metal Server instances. These profiles have a cpu_architecture of s390x and must be used with Red Hat Enterprise Linux for s390x and SUSE Linux Enterprise Server (SLES) for s390x. Each LinuxONE Bare Metal Server is equivalent to a logical partition (LPAR) on the IBM LinuxONE or IBM Z with dedicated s390x CPU cores, memory, and I/O devices for your Linux workloads."
        }
      ]
    }
  }
