{
    "title": "IBM Cloud VPC docs",
    "lastupdated": "2023-10-26",
    "introduction": "With IBM Cloud Virtual Private Cloud (VPC), you can quickly provision virtual server instances and other Infrastructure-as-a-Service (IaaS) offerings. Leverage the docs, API & SDK reference, architecture references, and more to support your infrastructure needs.",
    "section_devtools": {
      "api": "/apidocs/vpc",
      "cli": "/docs/vpc?topic=vpc-infrastructure-cli-plugin-vpc-reference",
      "terraform": "https://registry.terraform.io/providers/IBM-Cloud/ibm/latest/docs/resources/is_instance"
    },
    "section_recommended": [
      {
        "title": "Using the IBM Cloud console to create VPC resources",
        "description": "Get up and running quickly by completing this short tutorial to set up a VPC and subnet, configure an ACL, and create a virtual server instance with block storage and networking options.",
        "href": "/docs/vpc?topic=vpc-creating-a-vpc-using-the-ibm-cloud-console"
      },
      {
        "title": "Creating an instance group for auto scaling",
        "description": "Set up an instance group to dynamically add or remove instances according to your requirements.",
        "href": "/docs/vpc?topic=vpc-creating-auto-scale-instance-group"
      },
      {
        "title": "About creating an image from a volume",
        "description": "Learn about creating a custom image from a boot volume on a virtual server instance.",
        "href": "/docs/vpc?topic=vpc-image-from-volume-vpc"
      }
    ],
    "section_learn": {
      "architecture": "https://www.ibm.com/cloud/architecture/architectures/virtual-private-cloud"
    },
    "section_updates": {
      "view_more": "/docs/vpc?topic=vpc-release-notes",
      "tiles": [
        {
          "date": "24 October 2023", 
          "title": "Security group integration for network load balancers",
          "description": "For enhanced security, network load balancers can now be associated with security groups. You can associate one or more security groups with a new network load balancer when creating it, as well as associate security groups with your existing network load balancers."
        },
        {
          "date": "24 October 2023", 
          "title": "Very High Memory profiles available in all regions (GA)",
          "description": "The Very High Memory family of profiles are now available in the Madrid (MAD) region. This makes the vx2d profiles available in all regions."
        },
        {
          "date": "12 October 2023", 
          "title": "VPNs for VPC: Diagnose unhealthy VPN gateways and servers",
          "description": "When you see an existing VPN gateway or server in a degraded or faulted state, you can now diagnose the issue. You are presented with reasons for the state and actions to resolve the issue. "
        }
      ]
    }
  }
